# はじめの一歩

Haskellを始めるには、ファイルに保存するか、対話モードで行う

対話モードは、`ghci`とタイプする.

ファイルに関数を書いた場合は、そのファイルがある場所で`ghci`で対話モードを起動し、`:l ファイル名`とする`:l main`みたいに

こうすると、コンパイルが実行され、関数が使えるようになる

真理値はTrue,False

等しいは==, 等しくないは/=で比較する

## 関数呼び出し

`+` や `*` も関数

ただし、a + b のように呼び出される関数を中置関数という

ほとんどは前置関数

```
succ 5
> 6
```

関数呼び出しは関数名の後にスペースで引数を渡す

```
succ(5)
```

とかではない

2つの引数を取る前置関数を中置関数として書く方法がある

```
div 92 10
92 `div` 10
```

## 関数の定義

関数定義の構文は、関数名の後ろに引数、`=`を挟んで処理を書く

```
doubleMe x = x + x
```

```
doubleUs x y = doubleMe x + doubleMe y
```

として定義した関数から新たに関数を定義することもできる

### if文

haskellでのif文ではelseが必須となる

elseが無いと、ある場合にだけ値を返すという処理があり得てしまうが、haskellでは必ず関数はある値を返す必要があるため

```
doubleSmallNumber x = if x > 100
                        then x
                        else x * 2
```

コマンドライン上では次のように一行で書く

```
doubleSmallNumber x = if x > 100 then x else x * 2
とか
doubleSmallNumber x = (if x > 100 then x else x * 2) + 1
みたいな感じ
```

似たような名前で関数を作りたいときはアポストロフィ(')を使う

'は関数名として有効なので遅延じゃないバージョンの関数を作るときなどにも使う

```doubleMe' x = x * 2 ```

また、関数は先頭小文字で名前を付ける

関数が引数を取らないとき、これを定義とか名前とかと呼ぶ

文字列を入れたりする

## リスト

haskellでのリスト（配列）は同じ型しか入れることができない

```
let lostNumbers = [4,5,8,9,12,15]
```

letを付けるのはghciで実行するときのみ

### 連結

```
[1,2,3,4] ++ [5,6,7,8]
```

リストの先頭に値を追加するには

```
'A':" SMALL CAT"
> "A SMALL CAT"

5:[1,2,3,4]
> [5,1,2,3,4]
```

Haskellでは文字列もキャラクタの配列として扱う

### リストへのアクセス

```
"Hello World" !! 3
> "l"

[1,2,3,4,5,6,7] !! 4
> 5
```

リストはリストを入れ子にできるが、要素の型が同じでないといけない

### リストの比較

リスト同士を等号・不等号で比較することができる

比較ルールは、先頭の要素から順に比較していく

```
[2,3,4] < [2,4,5]
> True
```

配列の長さが異なり、大小が決まらない場合は配列の長い方が大きいとなる

### その他のリストの捜査

* head

先頭の要素を取り出す

```
head [5,6,7,8]
> 5
```

* tail

先頭を取り除いた残りの要素

```
tail [5,6,7,8]
> [6,7,8]
```

* last

末尾の要素

* init

末尾を取り除いた残りの要素

上記4つの関数に空のリストを渡すとエラーになる

* length

リストの長さを返す

* null

リストが空かどうか

* reverse

リストの反転

* take

先頭から引数の個数だけ要素を取り出す

```
take 3 [1,2,3,4,5,6]
> [1,2,3]
```

* drop

先頭から指定した個数の要素を取り除いた要素を返す

```
drop 3 [1,2,3,4,5,6,7]
> [4,5,6,7]
```

* maximum(minimum)

最大(最小)の要素を返す

```
maximum [2,6,4,9,11]
> 11
```

* sum

リストの合計

* product

リストの総積

* elem

第一引数がリストに入っているかどうか

```
elem 4 [1,2,3,4,5,6]
> True

4 `elem` [1,2,3,4,5,6]
> True
```

## レンジ

